# Management Half Year Report

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import src.io_utils as io
from src.ecommerce import EcommerceAnalyzer 
import src.metrics as M
import src.viz as V

In [3]:
df = io.df
df_clean = EcommerceAnalyzer(df).clean_df()
df_clean_month = EcommerceAnalyzer(df_clean).add_month()

In [4]:
M.revenue_per_category(df_clean)

      category  total_intäkt
0       Beauty     163053.97
1     Clothing     586744.91
2  Electronics    1364228.07
3         Home     511070.87
4       Sports     734653.42
5         Toys     143015.99

In [5]:
M.total_units(df_clean)

np.int64(7463)

In [6]:
M.top_categories(df_clean, n=3)

category
Electronics    1364228
Sports          734653
Clothing        586745
Name: revenue, dtype: int64

In [7]:
print(f"Average order value, AOV: {M.aov(df_clean):.0f}, Standardavvikelse: {M.aov_varians(df_clean):.0f}")

Average order value, AOV: 1401, Standardavvikelse: 1167

In [8]:
M.revenue_per_city(df_clean)

        city  total_intäkt
0   Göteborg     859019.65
1      Malmö     567926.32
2  Stockholm    1227201.94
3    Uppsala     551478.42
4   Västerås     297140.90

In [9]:
M.change_over_time(df_clean_month)

   month     intäkt
0      1  664083.32
1      2  548462.03
2      3  487602.00
3      4  580194.83
4      5  632165.16
5      6  590259.89